app/controllers/full_banners_controller.rb

SELECT * FROM `full_banners` WHERE (`full_banners`.`id` = 1)
---
  def show
    @full_banner = FullBanner.find(params[:id])

SELECT * FROM `full_banners` WHERE (`full_banners`.`id` = 1)
SELECT * FROM `pages` INNER JOIN `full_banners_pages` ON `pages`.id = `full_banners_pages`.page_id WHERE (`full_banners_pages`.full_banner_id = 1 )
---
  def add_pages
    @full_banner = FullBanner.find(params[:id])
    ids = ""
    @pages_add = []
    @full_banner.pages.collect do |p|

SELECT * FROM `full_banners` WHERE (`full_banners`.`id` = 1)
---
  def edit
    @full_banner = FullBanner.find(params[:id])

INSERT INTO `full_banners` (`name`, `created_at`, `updated_at`, `date_begin`, `file`, `link`, `date_end`) VALUES('TESTE', '2009-02-26 12:08:27', '2009-02-26 12:08:27', '2009-02-25 12:07:00', 'FILE.JǴ', '', '2009-04-26 12:07:00')
---
  def create
    @full_banner = FullBanner.new(params[:full_banner])

    respond_to do |format|
      if @full_banner.save

SELECT * FROM `full_banners` WHERE (`full_banners`.`id` = 1)
UPDATE `full_banners` SET `updated_at` = '2009-02-26 12:08:36', `file` = 'FILE.JPG' WHERE `id` = 1
---
  def update
    @full_banner = FullBanner.find(params[:id])

    respond_to do |format|
      if @full_banner.update_attributes(params[:full_banner])

SELECT * FROM `full_banners` WHERE (`full_banners`.`id` = 1)
DELETE FROM `full_banners` WHERE `id` = 1
---
  def destroy
    @full_banner = FullBanner.find(params[:id])
    @full_banner.destroy