app/controllers/groups_controller.rb

SELECT * FROM `groups` WHERE (`groups`.`id` = '--- :id\n')
SELECT * FROM `pages` INNER JOIN `groups_pages` ON `pages`.id = `groups_pages`.page_id WHERE (`groups_pages`.group_id = 1 )
---
   def add_pages
    @group = Group.find(params[:id])
    ids = ""
    @pages_add = []
    @group.pages.collect do |p|

SELECT * FROM `groups` WHERE (`groups`.`id` = '--- :id\n')
SELECT * FROM `pages` INNER JOIN `groups_pages` ON `pages`.id = `groups_pages`.page_id WHERE (`groups_pages`.group_id = 1 )
---
  def save_pages
    @group = Group.find(params[:id])
    if params[:lstIAdd].nil?
      @group.pages = []
      redirect_to :action => "index"
      return
    end

    @group.pages = Page.find(params[:lstIAdd])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def show
    @group = Group.find(params[:id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def edit
    @group = Group.find(params[:id])

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES('admin', '2009-02-25 14:40:05', '2009-02-25 14:40:05')
---
  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def update
    @group = Group.find(params[:id])