app/controllers/pages_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`id` = 0)
---
  def index
    @pages = Page.find(:all)

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
SELECT * FROM `groups` INNER JOIN `groups_pages` ON `groups`.id = `groups_pages`.group_id WHERE (`groups_pages`.page_id = 1 )
---
  def add_groups
    @page = Page.find(params[:id])
    ids = ""
    @groups_add = []
    @page.groups.collect do |p|

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
SELECT * FROM `groups` INNER JOIN `groups_pages` ON `groups`.id = `groups_pages`.group_id WHERE (`groups_pages`.page_id = 1 )
---
  def save_groups
    @page = Page.find(params[:id])
    if params[:lstIAdd].nil?
      @page.groups = []

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
SELECT * FROM `popups` INNER JOIN `pages_popups` ON `popups`.id = `pages_popups`.popup_id WHERE (`pages_popups`.page_id = 1 )
---
  def add_popups
    @page = Page.find(params[:id])
    ids = ""
    @popups_add = []
    @page.popups.collect do |p|

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
SELECT * FROM `full_banners`
---
  def add_full_banners
    @page = Page.find(params[:id])
    ids = ""
    @full_banners_add = []
    @page.full_banners.collect do |p|

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def edit
    bind_selects
    @page = Page.find(params[:id])

INSERT INTO `pages` (`name`, `obs`, `position`, `restricted`, `created_at`, `updated_at`, `color`, `title_visibility`, `publish`, `parent_id`, `content`, `link`, `is_menu`) VALUES('', '', 0, 0, '2009-02-25 13:03:56', '2009-02-25 13:03:56', '#fff', 1, 1, 0, 'teste danilo page 1', '', 0)
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
UPDATE `pages` SET `updated_at` = '2009-02-25 13:04:23', `name` = 'teste danilo', `obs` = 'sdssdsdsdsdsd', `position` = 0, `parent_id` = 0 WHERE `id` = 1
---
  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])