app/controllers/popups_controller.rb

  def show
    @popup = Popup.find(params[:id])
---
SELECT * FROM `popups` WHERE (`popups`.`id` = 1)

  def add_pages
    @popup = Popup.find(params[:id])
    ids = ""
    @pages_add = []
    @popup.pages.collect do |p|
---
SELECT * FROM `popups` WHERE (`popups`.`id` = 1)
SELECT * FROM `pages` INNER JOIN `pages_popups` ON `pages`.id = `pages_popups`.page_id WHERE (`pages_popups`.popup_id = 1 )

  def save_pages
    @popup = Popup.find(params[:id])
    if params[:lstIAdd].nil?
      @popup.pages = []
      redirect_to :action => "index"
      return
    end

    @popup.pages = Page.find(params[:lstIAdd])
---
SELECT * FROM `popups` WHERE (`popups`.`id` = 1)
SELECT * FROM `pages` INNER JOIN `pages_popups` ON `pages`.id = `pages_popups`.page_id WHERE (`pages_popups`.popup_id = 1 )

  def edit
    @popup = Popup.find(params[:id])
---
SELECT * FROM `popups` WHERE (`popups`.`id` = 1)

  def create
    @popup = Popup.new(params[:popup])

    respond_to do |format|
      if @popup.save
---
INSERT INTO `popups` (`name`, `created_at`, `updated_at`, `date_begin`, `height`, `file`, `link`, `width`, `date_end`) VALUES('TESTE', '2009-02-26 12:09:00', '2009-02-26 12:09:00', '2009-02-26 12:08:00', 200, 'TESTE.JPG', '', 200, '2009-04-26 12:08:00')

  def update
    @popup = Popup.find(params[:id])

    respond_to do |format|
      if @popup.update_attributes(params[:popup])
---
SELECT * FROM `popups` WHERE (`popups`.`id` = 1)
UPDATE `popups` SET `updated_at` = '2009-02-27 18:17:00', `file` = '' WHERE `id` = 1

  def destroy
    @popup = Popup.find(params[:id])
    @popup.destroy
---
SELECT * FROM `popups` WHERE (`popups`.`id` = 2)
DELETE FROM `popups` WHERE `id` = 2