app/controllers/web_controller.rb

  def index
    @page = Page.find(1)
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)